Од стандарден влез се задава димензијата на една матрица Аmxn (m,n<=100), а во продолжение се читаат елементите на матрицата. Елементите на матрицата се цели броеви. 

Да се испечатат сите збирови кои се добиваат со испишување на шаблонот за буквата N во матрицата A. Првиот шаблон се добива од подматрицата А1 (2x2) почнувајќи од индекс (0,0) во матрицата А, 
  наредниот од подматрицата А2 (3x3) исто така почнувајќи од индекс (0,0) во матрицата А итн.


  Пример:

Влез:

4
5

1 2 3 4 5

6 7 8 9 10

11 12 13 14 15

16 17 18 19 20


Излез:

16
49
100



  #include <iostream>
using namespace std;

int main() {
    int m, n;
    cin >> m >> n;


    int A[100][100];

   
    for (int i = 0; i < m; i++) {
        for (int j = 0; j < n; j++) {
            cin >> A[i][j];
        }
    }

    
    for (int size = 2; size <= m && size <= n; size++) { 
        int sum = 0;
        bool valid = true;

       
        for (int i = 0; i < size; i++) {
            sum += A[i][0];
        }

        
        for (int i = 0; i < size; i++) {
            sum += A[i][i];
        }

        
        for (int i = 0; i < size; i++) {
            sum += A[i][size - 1];
        }

        
        sum -= A[0][0]; 
        sum -= A[size - 1][size-1]; 

        cout << sum << endl;
    }

    return 0;
}
