//Од тастатура се читаат непознат број на позитивни цели броеви (со максимум 5 цифри) се додека не се внесе нешто различно од број. 
//За секој број треба да се најде позицијата (од десно на лево) на првото појавување на најголемата цифра во составот на бројот (цифрата на единици се наоѓа на позиција 0).
//Потоа, да се испечати статистика за позициите на најдените цифри со максимална вредност во следниот формат:

[позиција]: [вкупно броеви чија максимална цифра се наоѓа на таа позиција]
0: 2
1: 3
2: 1
3: 1
4: 1
за броевите 97654 48654 12345 12343 1263 12443 12643 12777



#include<iostream>
using namespace std;
int main(){
    int broj,pozicija,brojac,a=0,b=0,c=0,d=0,e=0,max,tmp;
    while(cin>>broj){
        tmp=broj;
        max=0;
        brojac=0;
        while(tmp){
            if(tmp%10>max){
                max=tmp%10;
                pozicija=brojac;
            }
            brojac++;
            tmp=tmp/10;
        }
        if(pozicija==0)a++;
        else if(pozicija==1)b++;
        else if(pozicija==2)c++;
        else if(pozicija==3)d++;
        else if(pozicija==4)e++;
        
    }
    cout<<"0: "<<a<<endl;
    cout<<"1: "<<b<<endl;
    cout<<"2: "<<c<<endl;
    cout<<"3: "<<d<<endl;
    cout<<"4: "<<e<<endl;
    return 0;
    
}
